Autodesk.Revit.DB.View3D.GetSectionBox
Gets a copy of the section box for this 3D view.
Remarks:
The section box cuts the model in this view by its boundaries.
Returns:
The section box.  Note that the section box can be rotated and transformed and thus you will need to use
Autodesk::Revit::DB::BoundingBoxXYZ::Transform to
interpret the coordinates of the corners or sides of the box in model coordinates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.